<template>
    <div class="userProtocol">
      <titleBack titleName="博学谷用户付费协议"></titleBack>
      <div class="payContent">
        <p>
         尊敬的博学谷用户：<br>
          欢迎登录博学谷学习平台，为保障用户权益，您须先成为博学谷普通注册用户之后，才能继续进行购买服务。请您在付费之前，详细阅读此服务协议（以下简称“本协议”）所有内容，<span style="color:#333;font-weight: bold;">特别是加粗部分</span>。当用户点选“【我已经阅读并同意《博学谷-用户付费协议》】”，即表示用户同意并承诺遵守本协议。<br>
          本协议内容包括协议正文、本协议下述明确援引的其他协议、博学谷已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。
        </p>
        <h1>
          第一条 定义
        </h1>
        <p>
         1、博学谷指江苏传智播客教育科技股份有限公司所有和经营的有关教育、学习等数字内容聚合、管理和分发的平台，旨在为用户提供教学内容及相关服务。
        </p>
        <br/>
        <p>
         2、收费课程是指由博学谷研发定制，并有偿提供给用户的视频、源码、文档、图片等内容。
        </p>
        <h1>
          第二条 本协议的修订
        </h1>
        <p>
         <span style="color:#333;font-weight: bold;">博学谷会根据互联网的发展和中华人民共和国有关法律、法规的变化，不断地完善服务质量并依此修改本协议。博学谷有权对本协议进行随时更新或补充，且毋须另行通知。若用户继续享有博学谷服务，则视为接受该协议的调整或补充，亦或用户有权终止使用该服务。</span>
        </p>
        <h1>
          第三条 用户规则
        </h1>
        <p>
          1、用户可在博学谷平台上浏览已经发布的内容信息（包括但不限于收费课程信息等），如用户希望有偿获得课程部分内容或服务，则用户需先登录或注册博学谷帐号或通过页面提示，选用其他第三方帐号进行登录。如用户选用其他第三方帐号进行登录的，用户应保证第三方帐号的稳定性、真实性以及可用性，如因第三方帐号原因（如第三方帐号被封号）致使用户无法登录博学谷的，用户应与第三方帐号的所属公司联系。用户使用博学谷登录帐号是博学谷确认用户身份的唯一依据。
        </p>
        <br/>
        <p>
         2、用户理解并同意：博学谷平台提供有偿内容或服务实行先付款后使用的方式，用户及时、足额、合法的支付所需的款项是使用该协议的有偿内容或服务的前提。
        </p>
        <br/>
        <p>
         3、用户理解并同意，博学谷平台发布的收费课程将采用整体购买的方式，即用户只需购买一次，就可以学习该课程所有已发布或即将发布的课程。<span style="color:#333;font-weight: bold;">关于已购买的付费课程视频资源使用时效说明如下：</span>
        </p>
        <br/>
        <p>
         <span style="color:#333;font-weight: bold;">3.1 视频资源在排除因不可抗力因素导致的损坏、丢失、下架等之外(包含但不仅限于此)，可正常观看；</span>
        </p>
        <br/>
        <p>
         <span style="color:#333;font-weight: bold;">3.2 针对某些设置有效期的视频课程，若已购买则视为接受有效期规则，博学谷不予退款，也不接受任何补差价等补偿方式；</span>
        </p>
        <br/>
        <p>
          <span style="color:#333;font-weight: bold;">3.3 若购买提供服务的课程，具体服务以官方公布的服务类别为准，如需用户配合签订培训协议，与本协议有冲突的，以双方签订的培训协议为准，如用户未按要求主动签署培训协议或放弃签署培训协议，即课程开通日期视为服务开始。</span>
        </p>
        <p>
         <span style="color:#333;font-weight: bold;">4、用户知悉并同意，用户无权对已购买的课程进行出售、转让、许可或其他方式允许除自己以外的第三方（包括但不限于自然人、法人或其他组织）使用其已购买的课程。若用户违反本条规定，则博学谷有权视情况采取如下措施：</span>
        </p>
        <br/>
        <p>
         <span style="color:#333;font-weight: bold;"> 4.1 取消用户继续使用该课程的权利；</span>
        </p>
        <br/>
        <p>
         <span style="color:#333;font-weight: bold;">4.2 限制/冻结用户的帐号；</span>
        </p>
        <br/>
        <p>
        <span style="color:#333;font-weight: bold;">4.3 要求用户退还其通过出售、转让、许可等其他方式取得的收益；</span>
        </p>
        <br/>
        <p>
        <span style="color:#333;font-weight: bold;">4.4 其他博学谷可以采取的补救措施。</span>
        </p>
        <br/>
        <p>
         <span style="color:#333;font-weight: bold;">5、用户了解并同意，博学谷基于自身原因（包括但不限于：更新课程内容、改进课程安排）有权不定期的对收费课程进行更新,而无需经过您的事先同意。</span>
        </p>
        <br/>
        <p>
          6、用户应保管好自己的帐号和密码（包括但不限于：邮箱帐号、手机号），如因用户未保管好自己的帐号和密码而对自身、博学谷造成损害的，用户将负全部责任。另外，用户应对用户帐号中的所有活动和事件负全责。用户可随时改变帐号和密码。用户同意若发现有非法使用用户的帐号或出现安全漏洞的情况，立即通告博学谷，博学谷将会尽力予以妥善解决。
        </p>
        <h1>
          第四条 其他约定
        </h1>
        <p>
         1、所有权及知识产权：博学谷平台上所有内容，包括但不限于文字、软件、声音、图片、录像、图表、网站架构、网站画面的安排、网页设计、源码、以及有偿内容或服务均由博学谷或其他权利人依法拥有其知识产权，包括但不限于著作权、商标权、专利权等。非经博学谷或其他权利人书面同意用户不得擅自使用、修改、复制、出租、传播、改变、散布、发行、录制或发表上述内容。如有违反，用户同意承担由此给博学谷、传智播客公司或其他权利人造成的一切损失。
        </p>
        <br/>
        <p>
         2、通知：所有发给用户的通知都可通过电子邮件、短信、系统消息、常规的信件或在网站显著位置公告的方式进行传送。
        </p>
        <br/>
        <p>
         3、本协议适用中华人民共和国的法律（不含冲突法）。当本协议的任何内容与中华人民共和国法律相抵触时，应当以法律规定为准，同时相关内容将按法律规定进行修改或重新解释，而本协议其他部分的法律效力不变。
        </p>
        <br/>
        <p>
          4、本协议自发布之日起实施，并构成用户和博学谷之间的共识。
        </p>
        <br/>
        <p>
         5、如果用户对本协议内容有任何疑问，请发送邮件至我们的工作人员邮箱：<br/><span class="protocalEmail">[bxgfk@itcast.cn]</span>。
        </p>
      </div>
    </div>
</template>

<script>
export default {
  name: "userProtocol"
};
</script>

<style scoped lang="less">
.userProtocol {
  background-color: #fff;
}
@import "paymentAgreement.less";
</style>
